blog/navicat-keygen.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Navicat Premium Keygen</title>
<!-- 2021-08-06 Fri 00:44 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">Navicat Premium Keygen</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 软件下载地址</a></li>
<li><a href="#sec-2">2. 项目地址</a></li>
<li><a href="#sec-3">3. 其他</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 软件下载地址</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://dn.navicat.com/download/navicat120_premium_en.dmg">https://dn.navicat.com/download/navicat120_premium_en.dmg</a>
</li>
<li><a href="https://dn.navicat.com/download/navicat150_premium_en.dmg">https://dn.navicat.com/download/navicat150_premium_en.dmg</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 项目地址</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://github.com/1178947261/navicat-keygen">https://github.com/1178947261/navicat-keygen</a>
</li>
<li><a href="https://github.com/HeQuanX/navicat-keygen-tools">https://github.com/HeQuanX/navicat-keygen-tools</a>
</li>
<li><a href="https://github.com/HeQuanX/navicat-keygen-tools/issues/3">https://github.com/HeQuanX/navicat-keygen-tools/issues/3</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 其他</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>make all 报错找不到-lplist++ 
</li>
</ul>
<pre class="example">
问题原因：libplist最新版本2.2.0修改了包名，“Rename library and all related files by adding an API version resulting in libplist-2.0 and libplist++-2.0”，
参考地址：https://github.com/libimobiledevice/libplist/releases/2.2.0
解决方案：修改Makefile文件，将“-lplist++”改为“-lplist++-2.0”。
</pre>

<ul class="org-ul">
<li>自签证书
</li>
</ul>
<p>
通过钥匙串访问进入证书助理，创建证书颁发机构，在用户证书一栏，一定要注意选择代码签名，切记。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>